Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_1.tmx
Source language: de
Languages: en

source: Treibriemenklammern aus Metall
en: Machine belt fasteners of metal

source: Zuganker aus Metall für Mauerwerk
en: Ties of metal for use in brickwork

source: Kanalabdeckungen aus Metall
en: Channel covers of metal

source: Beschickungsmulden aus Metall
en: Charging troughs of metal

source: Rollschächte aus Metall [ausgenommen als Maschinenteile]
en: Chutes of metal [other than parts of machines]

source: Drehkreuze aus Metall
en: Turnstiles of metal

source: Metallschlösser für Snowboards
en: Snowboard locks of metal

source: Kurbelzapfen aus Metall
en: Crank pins of metal

source: Leitplanken aus Metall
en: Crash barriers of metal

source: Fassadenteile aus Metall für Gebäude
en: Metallic building facade elements

source: Metallaußenbereichsjalousien aus Metall
en: Venetian blinds [outdoor] made of metal

source: Behälterverschlüsse aus Metall
en: Closures of metal for containers

source: Metallabläufe für wasserabweisende Systeme beim Kellerbau
en: Metal drains for use in construction of basement waterproofing systems

source: Metalllegierungen
en: Alloys of metal

source: Hülsen [unedle Metalle] für die Identifizierung von Haustieren
en: Barrels (Common metal -) for the identification of pet animals

source: Beckenstöpsel aus Metall
en: Basin plugs of metal

source: Unedle Metalle [roh oder teilweise bearbeitet] für die weitere Fertigung
en: Common metals, unwrought and semi-worked, for further manufacture

source: Bauten aus Metall
en: Buildings of metal

source: Plakatsäulen aus Metall
en: Advertisement columns of metal

source: Rolltore [aus Metall] mit isolierenden Eigenschaften
en: Roller doors (Metal -) having insulating properties

source: Dachbauteile aus Metall
en: Roof components of metal

source: Metallkapitelle als Teile von Säulen
en: Capitals (Metal -) being parts of columns

source: Tresore aus Metall [Geldschränke]
en: Strongrooms [safes] of metal

source: Stabilisierter Aluminiumschaum
en: Stabilized aluminum foam

source: Stahl in Form von Folien
en: Steel in the form of foils

source: Nicht leuchtende Baken aus Metall
en: Beacons of metal, non-luminous

source: Flussmittelumhüllte Schweißstäbe
en: Flux coated rods for welding

source: Metallfolien für Kochzwecke
en: Foils of metal for covering

source: Telefonkabinen aus Metall
en: Telephone booths of metal

source: Wände aus Metall
en: Walls of metal

source: Nicht elektrische Türöffner
en: Door openers, non-electric

source: Splinte aus Metall
en: Cotter pins of metal

source: Rohre aus Nickellegierungen
en: Tubes of nickel alloys

source: Arbeitsbühnen [Tragwerke]
en: Working platforms [structures]

source: Bearbeitete unedle Metalle
en: Wrought common metals

source: Horizontalzellen [außen], aus Metall
en: Horizontal venetian blinds [outdoor], of metal

source: Ortsfeste Bodenschwellen aus Metall
en: Sleeping policemen [fixed] (metal -)

source: Kanalschleusen aus Metall
en: Sluices [channels] of metal

source: Transportable Häuser aus Metall
en: Transportable houses of metal

source: Dachrinnenhalter aus Metall
en: Gutter supports of metal

source: Luppen [Metallurgie]
en: Blooms [metallurgy]

source: Zink zum Weichlöten
en: Spelter for soldering

source: Zink zum Schweißen
en: Spelter for welding

source: Edelstahl in Form von Blechen
en: Stainless steel in sheet form

source: Edelstahl in Streifenform
en: Stainless steel in strip form

source: Vorgefertigte Wandkonstruktionen aus Metall mit Mineralwolledämmung
en: Prefabricated wall structures of metal incorporating mineral wool insulation

source: Schwimmdocks aus Metall zum Vertäuen von Schiffen
en: Floating docks of metal, for mooring boats

source: Türklappen aus Metall
en: Door flaps of metal

source: Entnahmehahn aus Metall, ausgenommen Maschinenteile
en: Draw-off valves (metal -) [other than parts of machines]

source: Metalldeckel für Einstiegsschächte
en: Access chamber covers (Metallic -)

source: Abdeckplatten aus Metall
en: Access covers (Metal -)

source: Zusatzlegierungen für die Stahlproduktion
en: Additive alloys for the production of steel

source: Wohnungstüren aus Aluminium
en: Aluminium residential doors

source: Behälter aus Metall für die Lagerung von Flüssiggasen
en: Tanks of metal for the storage of liquefied gases

source: Gerüste aus Metall für Räume
en: Frameworks of metal for rooms

source: Metallbolzen für Türschlösser
en: Metal bolts for locking doors

source: Metallprofile mit Wärmeisolierung
en: Metal profiles with thermic isolation

source: Metallauffahrrampen [Bauwerke]
en: Ramps being structures of metal

source: Metallhalterungen für Glas
en: Mountings of metal for glass

source: Laschen aus Metall
en: Fish plates of metal

source: Rohranschlüsse aus Metall
en: Fittings of metal for pipes

source: Wandverkleidungen aus Metall für Bauzwecke
en: Wall covering of metal for buildings

source: Armierungsstangen aus Metall
en: Reinforcement rods of metal

source: Schilderhalter aus Metall
en: Metal holders for signboards

source: Metallgewächshausrahmen [Bauwerk]
en: Horticultural frames [structures] of metal

source: Metallhaken zum Festmachen
en: Mooring hooks of metal

source: Stifte [Dübel] aus Metall
en: Sprigs [dowel pins] of metal

source: Verzinkte Stahlplatten
en: Galvanized steel plate

source: Kleiderstangen aus Metall
en: Garment rails of metal

source: Glasleisten aus Metall
en: Glazing beads of metal

source: Gewächshäuser in Form von ortsfesten Metallbauten
en: Greenhouses being fixed metal structures

source: Gleitschienen aus Metall
en: Sliding rails of metal

source: Baumaterial aus Metall für Verstärkungszwecke
en: Reinforcement materials (Metal -) for construction

source: Gehwegeinfassungen aus Metall
en: Path edgings made of metal materials

source: Baukonstruktionen aus Metall
en: Building structures of metal

source: Transportable Bauten aus Metall in Form von Toilettenkabinen
en: Buildings (Portable -) of metal for housing toilets

source: Markisen aus Metall
en: Awnings of metal

source: Rosetten [Deckenverkleidungen] aus Metall
en: Roses [ceiling decorations] of metal

source: Versandlagergestelle [Bauten] aus Metall
en: Consignment shelving [structures] of metal

source: Werbeschilder aus Metall [nicht mechanisch, nicht leuchtend]
en: Advertising signs of metal [non-mechanical, not luminous]

source: Luftleitungen aus Metall für Gebäude
en: Air pipes of metal for buildings

source: Türhalterungen aus Metall
en: Door holders of metal

source: Türknäufe aus unedlem Metall
en: Door knobs of common metal

source: Metalltüren für den Zugang von Haustieren zu Gebäuden
en: Doors of metal for providing access to buildings by pets

source: Metallstützen für Decken
en: Ceiling supports of metal

source: Markisenkonstruktionen aus Metall
en: Porches [structures] of metal

source: Metallrollen für Garagentore
en: Metal garage door rollers

source: Gerüstvorrichtung aus Metall
en: Scaffolding apparatus (Metal -)

source: Schraubenkappen aus Metall
en: Screw covers of metal

source: Regalstützen aus Metall [ausgenommen Möbelteile]
en: Shelf supports of metal [other than parts of furniture]

source: Wartehäuschen aus Metall für Bushaltestellen
en: Shelters (Metal -) for use at bus stops

source: Bleischrot zum Strahlputzen
en: Shot (Lead -) for shotblasting

source: Transportabel Bauten aus Metall mit sanitären Anlagen
en: Mobile [portable] buildings of metal containing sanitary installations

source: Mobile Hubarbeitsbühnen [Gerüste] aus Metall
en: Mobile aerial work platforms [scaffolding] of metal

source: Gepanzerte Türen aus Metall
en: Armoured doors of metal

source: Metallrahmen für Schiebetüren
en: Metallic frames for sliding doors

source: Halbfertigerzeugnisse aus Nickel und dessen Legierungen
en: Semi-finished articles of nickel or its alloys

source: Gepanzerte Fenster mit Metallrahmen
en: Armoured windows having metal frames

source: Kunstgegenstände aus Bronzeguss
en: Artistic castings of bronze

source: Metallische Balkoneinfassungen
en: Balcony enclosures (Metallic -)

source: Aluminiumlegierungen mit Bauxitverstärkung
en: Bauxite reinforced aluminium alloys

source: Balken aus unedlem Metall für Schalungssysteme
en: Beams of common metal for formwork systems

source: Namensarmbänder aus Metall
en: Metal identification bracelets

source: Fesseln [Fußschellen] aus Metall
en: Shackles [leg irons] made of metal

source: Schuppen aus Metall [Gebäudekonstruktion]
en: Shelters [building structures] of metal

source: Verzinkte Stahlbleche
en: Zinc-coated steel sheets

source: Zapfen aus Metall [Stopper]
en: Spigots [stoppers] of metal

source: Metallbehälter für Aufbewahrungszwecke
en: Boxes for storage purposes [metal]

source: Pflasterplatten aus Metall
en: Paving slabs of metal

source: Pergolen aus Metall
en: Pergolas of metal

source: Grabtafeln aus unedlem Metall
en: Grave markers of non-precious metal

source: Metallablaufrinnen zum Ableiten von Regenwasser
en: Guttering of metal for the dispersal of rain-water

source: Gehwegplatten aus Metall
en: Promenade tiles of metal

source: Regentonnen aus Metall
en: Rain barrels of metal

source: Zaunglieder aus Metall
en: Fence links of metal

source: Körbe aus unedlen Metallen
en: Baskets of common metals

source: Lötpräparate bestehend aus Lötmetalle und Flussmittel
en: Soldering preparations comprising solder metal and flux

source: Längsholme aus Metall für Bauzwecke
en: Spars of metal for use in building

source: Papierhandtuchspender aus Metall [ortsfest]
en: Paper towel dispensers [fixed] of metal

source: Drehflügeltüren aus Metall
en: Revolving doors of metal

source: Dachbeläge aus Metall
en: Roof coverings of metal

source: Haken aus Metall für Dachschiefer
en: Hooks of metal for roofing slates

source: Rohre aus Metall als Hauptleitungen für Gase
en: Ducts made of metal for trunking pipes for gases

source: Rohre aus Metall als Hauptrohre für Flüssigkeiten
en: Ducts made of metal for trunking pipes for liquids

source: Metallmaterialien für Bauzwecke
en: Metal goods for use in building

source: Röhren aus Metall einschließlich aus Stahllegierungen und Titan
en: Pipes of metal including those from alloy steel and titanium

source: Verglasungstafeln [Metallrahmen] für Bauzwecke
en: Glazing panels [metallic framed] for use in construction

source: Metallische Fallrohre
en: Metal down spouts

source: Klammern für Bauzwecke
en: Staples for construction use

source: Ankervorrichtungen aus Metall
en: Anchoring devices of metal

source: Eisenbahnschienenbaumaterial aus Metall
en: Materials of metal for railway construction

source: Pfosten [Metall]
en: Uprights of metal

source: Leitungen aus Metall für Lüftungs- und Klimaanlagen
en: Ducts of metal for ventilating and air-conditioning installations

source: Glocken [mit Metallrahmen] für gärtnerische Zwecke
en: Cloches (Metal framed -) for horticultural use

source: Frühbeetkästen aus Metall
en: Cold frame boxes of metal

source: Kaltgewalzte Bleche
en: Cold rolled sheet metal

source: Vorgefertigte Kais aus Metall
en: Platforms, prefabricated, of metal

source: Rolltore aus Metall
en: Roller doors of metal

source: Stahl in Form von Blechen
en: Steel in the form of sheets

source: Elektronische Safes
en: Electronic safes

source: Schilder aus Metall
en: Signboards of metal

source: Fliesen aus Metall für Bauzwecke
en: Floor tiles of metal for building

source: Folien aus Metall für Verpackungszwecke
en: Foils of metal for wrapping and packaging

source: Gurtbänder aus Metall für den Lastentransport
en: Webbing straps (Metallic -) for handling loads

source: Kacheln aus Metall für Bauzwecke
en: Tiles of metal for building

source: Rohrmuffen aus Metall
en: Pipe muffs of metal

source: Handtuchspender aus Metall
en: Towel dispensers of metal

source: Transportable Bauten aus Metall
en: Buildings, transportable, of metal

source: Dehnbare Metallgitter
en: Expandable metal grids

source: Spreizbolzen aus Metall
en: Expansion bolts of metal

source: Abzweigrohrschellen aus Metall
en: Branch outlet fittings of metal

source: Beregnungsrohre aus Metall
en: Sprinkling pipes of metal

source: Farbspritzkabinen aus Metall
en: Paint spraying booths of metal

source: Drainagerohre aus Metall
en: Drain pipes of metal

source: Aluminiumrahmenmodulbühnen zur Verwendung in Theatern
en: Aluminium framed modular platforms for use in theatres

source: Gewächshausrahmen aus Metall
en: Greenhouse frames of metal

source: Außenlamellenvorhang aus Metall
en: Metal vertical blinds [external]

source: Scheiben aus Metall
en: Washers of metal

source: Metalltüren für den Innenbereich
en: Doors of metal for indoor use

source: Klammerklemmen aus Metall
en: Clip clamps of metal

source: Grabeinfassungen aus Metall
en: Enclosures of metal for tombs

source: Fahrzeugschlösser aus Metall
en: Locks of metal for vehicles

source: Silos aus Metall
en: Silos of metal

source: Verkleidungsteile für Metallbauten
en: Surfacings for building [metal]

source: Zierfigurinen aus unedlem Metall
en: Ornamental figurines of common metal

source: Metallrolltore für Sicherheitszwecke
en: Metal roller shutter doors for security purposes

source: Bedachungsmaterial aus Metall
en: Roofing materials of metal

source: Zink
en: Zinc

source: Nicht elektrische Kabeltrommeln aus Metall
en: Cable drums (Non-mechanical -) of metal

source: Befestigungsteile aus Metall
en: Fixing devices of metal

source: Laufbühne aus Metall
en: Walkways of metal

source: Metallscharniere zur Befestigung von Elektrokabeln
en: Hinges of metal for the fastening of electrical cables

source: Metallarmierungsstäbe für Mauerwerk
en: Reinforcing bars of metal for use in brickwork

source: Dachfirste aus Metall
en: Roof ridges of metal

source: Bleche aus Metall einschließlich aus Stahllegierungen und Titan
en: Sheets of metal including those from alloy steel and titanium

source: Platten aus Metall einschließlich aus Stahllegierungen und Titan
en: Slabs of metal including those from alloy steel and titanium

source: Kabelkanäle aus Metall für Elektrokabel
en: Trunking [channels] of metal for electric cables

source: Dehnstoßprofile aus Metall für Fußböden und Wände
en: Metal expansion joints for floors and walls

source: Feuerbeständige Metallsafes
en: Metal fire resistant safes

source: Leere Metalldosen
en: Metal cans, sold empty

source: Schildtafeln aus Metall
en: Signs plates of metal

source: Aluminiumverbundrohre für die Herstellung von Fahrradrahmen
en: Aluminum composite tubing for use in the manufacture of bicycle frames

source: Metallplatten für Raumteiler [ausgenommen Möbel]
en: Room divider panels of metal [other than furniture]

source: Getränkekästen aus Metall
en: Bottle crates of metal

source: Modulare transportable Baukonstruktionen aus Metall
en: Modular portable building structures [metal]

source: Gewinderinge aus Metall
en: Screw rings of metal

source: Stahl
en: Steel

source: Transportable Pferdeställe aus Metall
en: Portable stables of metal for horses

source: Trinkwasservorratsbehälter aus Metall
en: Potable water reservoirs of metal

source: Vorgefertigte Balkone [Metall]
en: Prefabricated balconies [metal]

source: Nicht elektrische Fensteröffner
en: Window openers, non-electric

source: Antennendraht [nicht elektrisch]
en: Wire for aerials [other than electric]

source: Boxen [Bauwerk] aus Metall für Tiere
en: Stalls [structures] of metal for animals

source: Torhaken aus Metall
en: Gate hooks of metal

source: Bettbeschläge aus Metall
en: Fittings of metal for beds

source: Zeitkapseln aus Metall
en: Metal time capsules

source: Metallrohre für gewerbliche Zwecke
en: Metal tubes for industrial use

source: Stahlflaschen für komprimierte Gase
en: Steel cylinders for compressed gas

source: Schrankbeschläge aus unedlen Metall
en: Cabinet fittings of common metal

source: Gewächshäuser [Bauten] aus Metall
en: Conservatories [structures] of metal

source: Haftfähige Wanddekorationen aus unedlem Metall
en: Adhesive wall decorations of common metal

source: Nicht leuchtende Werbetafeln aus Metall
en: Advertisement display boards of metal [non-luminous]

source: Lüftungskanäle aus Metall für Gebäude
en: Air ducts of metal for buildings

source: Reibungstürhalter aus Metall
en: Door friction stays of metal

source: Türgitter aus Metall
en: Door guards of metal

source: Abzweigrohre aus Metall für Rohrleitungen
en: Branching tubes of metal for pipelines

source: Schienenbaumaterial aus Gusseisen
en: Cast iron material for railroad tracks

source: Schraubnieten aus Metall
en: Screw rivets of metal

source: Unterstände aus vorgefertigten isolierten Metallmaterialien
en: Shelters made of prefabricated metal insulated materials

source: Gepanzerte Metallwände
en: Armoured metal walls

source: Metallrohlinge für die Herstellung von Patronenhülsen
en: Blanks of metal for the manufacture of shell cases

source: Kennzeichnungsbänder aus Metall für Blutentnahmesysteme
en: Metal identification bands for blood collection systems

source: Lagerschuppen aus Metall
en: Metal storage shelters

source: Sicherheitsbeschläge aus Metall für Türen
en: Safety fittings of metal for doors

source: Fallen für wilde Tiere
en: Traps for wild animals

source: Metallflaschen zur Aufbewahrung von Brennstoffen
en: Bottles of metal for the storage of fuel

source: Verpackungskisten in zusammenlegbarer Form aus Metall
en: Boxes (packaging -) in collapsible form [metal]

source: Verpackungskisten in fertiger Form aus Metall
en: Boxes (packaging -) in made-up form [metal]

source: Terrassentüren aus Metall
en: Patio doors of metal

source: Straßenpflaster aus Metall
en: Pavements made of metal

source: Metallablaufrinnen zum Ableiten von Abwasser
en: Guttering of metal for the dispersal of wastewater

source: Metallverschlüsse zur Verhinderung von Gasverlust
en: Seals of metal for preventing leakage of gases

source: Lagerpaletten aus Metall
en: Storage pallets of metal

source: Metalle zum Schweißen von Gusseisen
en: Metals for welding cast iron

source: Tunnelauskleidungsteile aus Metall
en: Tunnel lining segments made of metal

source: Leiterhaken aus Metall
en: Ladder hooks of metal

source: Laufrollen, Federn und Ventile aus Metall [ausgenommen Maschinenelemente]
en: Metal pulleys, springs and valves [not including machine elements]

source: Schachtdeckel aus Metall
en: Manhole covers of metal

source: Ketten aus Metall zum Anbinden von Tieren
en: Chains (Metal -) for use as animal tethers

source: Metallrahmen für Bauzwecke
en: Frames of metal for building

source: Transportable, metallische Bauten
en: Metal door viewers [non-magnified]

source: Motorständer aus Metall
en: Metal engine stands

source: Folien und Bleche aus Metall für die Herstellung von Leiterplatten
en: Films and sheets made from metal for use in the manufacture of circuit boards

source: Ankerflanschen aus Metall
en: Anchor flanges of metal

source: Ankerfassungen für Pfosten [aus Metall]
en: Anchor sockets for posts (Metal -)

source: Drehstangenverschlüsse aus Metall
en: Espagnolette mechanisms of metal

source: Paletten aus Metall zum Be- und Entladen
en: Loading and unloading pallets of metal

source: Körbe aus Metall
en: Baskets of metal

source: Kunsteisbahnen [Bauten] aus Metall
en: Skating rinks [structures] of metal

source: Federn [Kleineisenwaren]
en: Springs [metal hardware]

source: Schlossgehäuse aus Metall
en: Lock casings of metal

source: Lüftungslamellen aus Metall für Gebäude
en: Louvre vents (Metal -) for buildings

source: Briefkästen aus Metall
en: Letter boxes of metal

source: Schachtrahmen aus Metall
en: Manhole frames of metal

source: Schlüsselringe aus unedlen Metallen
en: Split rings of common metal for keys

source: Senkrechte Außenrollläden aus Metall
en: Vertical blinds [outdoor] of metal

source: Lattenfensterläden aus Metall
en: Metallic slatted shutters

source: Ortgangbretter aus Metall
en: Barge boards (Metallic -)

source: Leitplanken aus Metall für Straßen
en: Crash barriers of metal for roads

source: Körbe aus unedlem Metall für gewerbliche Zwecke
en: Baskets of common metal for industrial use

source: Scharnierbänder aus Metall
en: Strap-hinges of metal

source: Bänder aus unedlen Metallen zur Identifikation von Haustieren
en: Common metal bands for the identification of pet animals

source: Drahtringe aus unedlem Metall
en: Coils made of common metal

source: Verpackungsbehälter aus Metall
en: Packaging containers of metal

source: Metallischen Dosen [Behälter]
en: Metallic capsules [containers]

source: Stahl in Form von Platten
en: Steel in the form of plates

source: Mörtelmischtröge aus Metall
en: Troughs of metal for mixing mortar

source: Altpapiertonnen aus Metall für gewerbliche Zwecke
en: Waste paper bins of metal for industrial use

source: Brücken [Bauten] aus Metall
en: Bridges [structures] of metal

source: Eisschrauben aus Metall
en: Ice screws of metal

source: Kioske [Bauwerk] aus Metall
en: Kiosks [structures] of metal

source: Metallroste für Straßen
en: Grilles of metal for roads

source: Gullys aus Metall
en: Gulleys of metal

source: Ablaufrinnen aus Aluminium
en: Guttering of aluminium

source: Streben aus Metall
en: Bracings of metal

source: Halterungen aus Metall zum Aufhängen von Fenstervorhängen
en: Brackets of metal for hanging window draperies

source: Baumaterial aus Stahl
en: Steel building materials

source: Metallhebeschlingen zum Bewegen von Lasten
en: Hoisting slings of metal for handling loads

source: Auskleidungsplatten aus Metall
en: Cladding panels of metal

source: Roher oder teilweise bearbeiteter Guss
en: Cast iron, unwrought or semi-wrought

source: Türen aus Metall
en: Doors of metal

source: Türketten aus Metall
en: Door chains of metal

source: Bronzen für Grabmäler
en: Bronzes for tombstones

source: Akustikpaneele aus Metall für Decken
en: Acoustic panels of metal for ceilings

source: Behälter aus Aluminiumfolie
en: Aluminium foil containers

source: Aluminiumfolienpapier als Laminat
en: Aluminium foil paper laminates

source: Metallbauteile für Türen
en: Metal components for doors

source: Bauten mit Metallrahmen
en: Metal framed buildings

source: Eingefasste Hängedecken aus Metall
en: Metal framed suspended ceilings

source: Metallische Außenjalousien
en: Metal venetian blinds [external]

source: Kupferrohre [ausgenommen als Maschinenteile]
en: Copper tubes [other than parts of machines]

source: Verkleidungstafeln aus Metall für den Wandbau
en: Cladding panels of metal for wall construction

source: Zwecke aus Metall
en: Tacks of metal

source: Fasshähne aus Metall
en: Taps of metal for casks

source: Überlaufrinnen aus Metall
en: Overflow channels of metal

source: Schienen für Deckenaufhängungen aus Metall
en: Overhead suspension tracks of metal

source: Versetzbare Wände aus Metall
en: Moveable walls made of metal

source: Bleche mit Nickel-Zink-Plattierung
en: Nickel-zinc plated sheet metal

source: Deckenkassetten aus Metall
en: Ceiling coffers of metal

source: Eisengussteile [Halbfabrikate]
en: Iron castings [semi-finished]

source: Dachrinnen aus Metall
en: Roof gutters of metal

source: Galenit [Erz]
en: Galena [ore]

source: Hafnium [Celtium]
en: Celtium [hafnium]

source: Waren aus unedlen Metallen und deren Legierungen für Bauzwecke
en: Architectural hardware made of common metals and alloys thereof

source: Lötmetall für unedle Metalle
en: Solder (Metal -) for common metals

source: Figurinen aus unedlem Metall als Kunstgegenstände
en: Figurines of common metal being works of art

source: Selbstklebende Bleistreifen zur Fensterdekoration
en: Self-adhesive lead strips for making a pattern on windows

source: Kanalrohre aus Metall
en: Sewer pipes of metal

source: Mahlkugeln aus Stahl
en: Steel grinding balls

source: Handläufe aus Metall zur Verwendung in Gebäuden
en: Handrails of metal for use in buildings
